package pro.haichuang.manni.data;

public class Constant {
    public static String agreement="帮帮卡协议\n" +
            "\n" +
            "1.当您通过网络或APP端页面点击“同意”（或其他类似意思表示）的方式签订本协议及与本协议有关的任何法律文件，即表示您与本平台已达成协议并同意接受本协议的全部约定内容以及其他与本协议有关的各项约定，与亲笔签名具有同等法律效力，协议双方无需重新补办书面文书。\n" +
            "\n" +
            "2.请您务必妥善保管重要协议信息，如因您的个人原因，无论是故意或过失，使得重要协议信息被他人所控制，由此可能带来的不利后果均由您承担。届时您不得以账号等重要信息丢失、被盗用等任何理由否认签约的效力及履行本协议的义务。\n" +
            "\n" +
            "3.您认可电子数据的有效性和证据效力。前述电子数据包括但不限于本平台自有及第三方服务平台系统所生成和保留记载的相关电子协议、电子单据、电子凭证、交易记录等相关资料均构成有效证明协议各方之间权利义务关系的确定证据。\n" +
            "\n" +
            "4.如本协议与《用户注册协议》或其他您与本平台签署的协议中的条款、陈述存在不一致或有冲突情形的，以本协议约定为准；未存在不一致或有冲突情形的，仍适用《用户注册协议》或其他您与本平台签署的协议。\n" +
            "\n" +
            "甲方：    \n" +
            "\n" +
            "\n" +
            "\n" +
            "乙方（用户）姓名：                    身份证号码：            \n" +
            "\n" +
            "定义\n" +
            "\n" +
            "1.1本平台帮帮卡：是指在本平台APP平台点击同意本协议全部内容并完成付费的自然人。 \n" +
            "\n" +
            "服务内容\n" +
            "\n" +
            "2.1本平台通过帮帮卡制消费服务模式，成为帮帮卡用户后，您将享受本平台为您提供的信息居间服务，我们将为您匹配合适的第三方借款平台。\n" +
            "\n" +
            "2.2本平台有权收取一定的帮帮卡服务费用，收取标准以本平台页面展示的帮帮卡价格为准。\n" +
            "\n" +
            "帮帮卡使用注意事项\n" +
            "\n" +
            "3.1申请开通时,同意并提交本人手机号码、证件号码等所需的个人信息资料,并保证其提供的资料真实、准确、完整、合法有效。个人信息资料如有变动的,应及时更新,并承担因未及时更新造成的损失。\n" +
            "\n" +
            "3.2服务开通后,应谨慎合理的保存、使用其用户名和密码,不得借给他人使用,否则帮帮卡用户应自行承担由此产生的全部责任。\n" +
            "\n" +
            "3.3帮帮卡用户同意并承诺,其应合理合法使用其享有的帮帮卡权益,除为实现自身的帮帮卡利益外不得利用其享有的权益非法获利,不得以任何形式售卖或转让其所享有的权益,不得滥用其所享有的权益。\n" +
            "\n" +
            "协议的变更、终止与违约责任\n" +
            "\n" +
            "4.1本平台保留在中华人民共和国法律法规允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容等相关权利。\n" +
            "\n" +
            "4.2开通帮帮卡服务后,帮帮卡用户在服务期内主动取消帮帮卡服务的,本平台不退还帮帮卡服务费用。\n" +
            "\n" +
            "4.3根据国家法律法规变化及平台运营需要本平台会不定期对相关服务规则进行修改,建议帮帮卡用户在使用本平台平台服务前仔细阅读平台页面上的公告或通知。\n" +
            "\n" +
            "4.4如帮帮卡用户发生下列任何一种行为,构成严重违约,本平台有权随时终止向该帮帮卡用户提供本协议项下的帮帮卡服务,且无需退还帮帮卡用户服务费用\n" +
            "\n" +
            "4.4.1提供虚假的个人资料,后果严重的;\n" +
            "\n" +
            "4.4.2以营利、经营等非个人使用的目的为自己或他人申请开通本平台帮帮卡服务的;\n" +
            "\n" +
            "4.4.3恶意操作、诋毁、损害本平台的声誉\n" +
            "\n" +
            "4.4.4使用帮帮卡权益服务时未按规定支付相应帮帮卡费用的;\n" +
            "\n" +
            "4.4.5严重违反本协议中约定的服务使用规则及不时更新发布的新的相关操作规则;" +
            "4.4.6利用帮帮卡服务从事违反国家法律法规的行为。\n" +
            "\n" +
            "4.5除本协议另有约定外,如一方违反有关法律、法规或本协议项下任何条款而给对方造成损失的,违约一方须向对方承担由此造成的损害赔偿责任。\n" +
            "\n" +
            "帮帮卡收费\n" +
            "\n" +
            "5.1 收费标准：269元\n" +
            "\n" +
            "5.1.1费用包含：\n" +
            "\n" +
            "1）信用评估服务费69元\n" +
            "\n" +
            "信用评估服务包含：查询服务、评估服务；我们将引入第三方的合规网络征信查询平台为您提供查询服务，经查询后的信息由本平台进行评估测算后，将形成您的专属资信报告。此项目为付费服务，将在您提供个人信息并支付帮帮卡服务费后生效，您可在帮帮卡有效期内前往帮帮卡服务中心查看。\n" +
            "\n" +
            "3）居间服务费200元\n" +
            "\n" +
            "本平台将根据您的资信报告提供帮帮卡VIP专属的借款通道，您可前往“我要借钱”页面体验与享受该项服务；如您经专属通道借款并成功借款的，平台将收取200元居间服务费。如全部通道均借款不成功，您可通过本平台发起退款，具体退款流程详见退款规则。\n" +
            "\n" +
            "5.2.1 如您选择成为帮帮卡用户，您可享受的权益如下：\n" +
            "\n" +
            "●贷款专属审核通道，优先推荐； \n" +
            "\n" +
            "●享受信用查询服务，降低贷款被拒率；\n" +
            "\n" +
            "●享受专属产品，普通用户无权申请；\n" +
            "\n" +
            "●更多产品推荐，贷款成功率增大；\n" +
            "\n" +
            "●有效期内享有帮帮卡尊贵标识；\n" +
            "\n" +
            "●参与本平台不定时推出的帮帮卡活动。\n" +
            "\n" +
            "5.3本平台帮帮卡权益是一项个人的、非独家的、不可转让的、有服务期限的权利。成为本平台帮帮卡用户后,可享受的帮帮卡权益以本平台平上帮帮卡权益频道公示的信息为准。\n" +
            "\n" +
            "5.4随着服务类型的广泛化,在平衡帮帮卡用户总体权益不变的情况下,本平台有权根据市场情况对帮帮卡权益进行部分调整。本平台就前述权益调整时须提前在本平台APP首页或帮帮卡网站特权中心以公告的形式予以发布,公告自发布之时开始生效。\n" +
            "\n" +
            "5.5帮帮卡权益调整后,如果继续使用本平台平台服务的,即视为接受帮帮卡权益调整,同意本平台对本协议相关条款所作的修改;如不接受帮帮卡权益调整,双方协商确定解决方案。双方协商终止协议的,对已交纳的帮帮卡费用,在扣除已经使用的帮帮卡权益所节省的费用后,按照帮帮卡权益服务期间进行平摊。如有剩余,退回剩余部分的帮帮卡费用。\n" +
            "\n" +
            "5.6首次购买帮帮卡后，您将同意授权，再次购买帮帮卡时无需再验证，平台即可进行扣费。\n" +
            "\n" +
            "退费规则\n" +
            "\n" +
            "6.1  帮帮卡退费规则：\n" +
            "\n" +
            "6.1.1 平台将收取信用评估服务费69元（包含征信检测、多头借贷检测、黑名单检测、贷前风控审核等具体以平台展示为准），此费用不可退。\n" +
            "\n" +
            "6.1.2 居间服务费200元，如居间服务未成功，即您通过本平台推荐的所有专属通道未借款成功的，可前往“我要退款”页面发起退费申请。届时请您保存借款失败、申请被拒等截图，提交本平台审核。\n" +
            "\n" +
            "6.2 退费通道\n" +
            "\n" +
            "6.2.1如您在满足条件情况下申请退款的，须在本平台线上操作，退费需要您提供完整资料。经本平台将在5个工作日内进行审核，审核成功后将费用退还至您的支付宝账户或您的支付银行卡。\n" +
            "\n" +
            "6.2.2在申请退款时，请您务必仔细填写相关信息，若因您填写账户有误导致无法接收退费的，相关责任由您本人承担。\n" +
            "\n" +
            "帮帮卡用户个人信息保护\n" +
            "\n" +
            "7.1保护帮帮卡用户个人信息安全是本平台一贯坚守的基本原则,本平台保证不对外公开提" +
            "供单个帮帮卡用户的信息资料以及帮帮卡用户在使用网络服务时存储在本平台的非公开内容,但下列情况除外\n" +
            "\n" +
            "7.1.1已获得帮帮卡用户授权的\n" +
            "\n" +
            "7.1.2根据有关法律法规的要求,按照相关政府主管部门、司法机关的要求需要提供的\n" +
            "\n" +
            "7.1.3维护本平台的合法权益;\n" +
            "\n" +
            "7.2本平台会与第三方合作向帮帮卡用户提供相关的帮帮卡权益服务。在事先取得帮帮卡用户的授权后,本平台有权将帮帮卡用户的个人信息资料提供给合作第三方,合作第三方对帮帮卡用户个人信息同样负有保密义务。\n" +
            "\n" +
            "7.3在不透露单个帮帮卡用户个人信息资料的前提下,本平台有权对整个用户数据库进行分析或调查研究,并对用户数据库进行商业上的利用。\n" +
            "\n" +
            "免责声明\n" +
            "\n" +
            "8.1如因不可抗力或其他本平台无法控制的原因,导致本平台无法及时提供服务或无法按本协议履行的,本平台会合理地尽力协助处理后续事宜,但不承担赔偿责任。\n" +
            "\n" +
            "8.2本平台不对帮帮卡用户因第三方的行为或不作为造成的损失承担赔偿责任,包括但不限于支付服务、网络接入服务、侵权行为或其他违法违规行为。\n" +
            "\n" +
            "8.3对于帮帮卡用户自本平台平台获得的非本平台自身的信息、内容或者广告宣传等资讯,本平台不承担保证其真实、准确和完整的责任。帮帮卡用户应自行甄别真伪,谨慎防范风险。无论出于何种原因,本平台无需对帮帮卡用户或任意第三方承担赔偿责任。\n" +
            "\n" +
            "法律适用和管辖\n" +
            "\n" +
            "9.1本协议条款的订立、生效、履行、解释及争议的解决均适用中华人民共和国法律法规。 \n" +
            "\n" +
            "9.2如发生本协议某些条款与现行法律法规相抵触时,则这些条款将完全按法律规定重新加以解释,其余条款继续有效。\n" +
            "\n" +
            "9.3就本协议内容或其履行发生任何争议,双方应尽力友好协商解决;协商不成时,任何方均可向协议本平台所在地人民法院提起诉讼。\n" +
            "\n" +
            "其他\n" +
            "\n" +
            "10.1 请您确保自己为18周岁以上完全民事行为能力人。\n" +
            "\n" +
            "10.2帮帮卡用户同意,本平台可以通过网页公告、页面提示、弹窗、帮帮卡用户预留联系方式(电子邮件、手机短信)、电话等通知方式,向其发送相关活动的必要信息。\n" +
            "\n" +
            "\n" +
            "\n" +
            "甲方：    \n" +
            "\n" +
            "\n" +
            "\n" +
            "用户姓名：              \n" +
            "\n" +
            "\n" +
            "\n" +
            "\n" +
            "\n" +
            "签署时间：   年   月  日";


    //关闭协议及验证手机界面
    public static int CLOSE_VIP_ATY = 1;
    //关闭修改手机界面
    public static int CLOSE_PHONE = 2;
}
